Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: Branches are valuable because they turn a scarce resource&mdash;working room in the project's code&mdash;into an abundant one. Normally, all developers work together in the same sandbox, constructing the same castle. When someone wants to add a new drawbridge, but can't convince everyone else that it would be an improvement, branching makes it possible for her to go to an isolated corner and try it out. If the effort succeeds, she can invite the other developers to examine the result. If everyone agrees that the result is good, they can tell the version control system to move ("merge") the drawbridge from the branch castle over to the main castle.
gl: As ramas son valiosas xa que converten un recurso escaso &mdash;espazos de traballo no código do proxecto&mdash; nun considerablemente máis abundante. Normalmente todos os desenvolvedores traballan conxuntamente sobre unha mesma versión do software, construíndo un único castelo. Cando alguén quere engadir unha nova torreta, mais non é quen de convencer o resto de que se debería facer iso, a creación dunha rama vaille dar a oportunidade de facelo nunha esquiniña. Se o esforzo ten éxito, pode convidar os outros desenvolvedores a examinaren os resultados. Se todos estiveren de acordo en que o resultado paga a pena, entón poden dicirlle ao sistema de control de versións que mova (fusione -merge) a torreta desde a rama ao castelo principal.

source: It's easy to see how this ability helps collaborative development. People need the freedom to try new things without feeling like they're interfering with others' work. Equally importantly, there are times when code needs to be isolated from the usual development churn, in order to get a bug fixed or a release stabilized (see <xref linkend="stabilizing-a-release"/> and <xref linkend="release-lines"/><phrase output="printed"> in <xref linkend="development-cycle"/></phrase>) without worrying about tracking a moving target.
gl: É doado ver como esta habilidade axuda ao desenvolvemento colaborativo. A xente precisa da liberdade de probaren cousas novas sen sentiren que están a interferir co traballo dos demais. Igualmente importante, hai momentos en que o código precisa ser isolado das tarefas habituais, para corrixir un erro ou estabilizar unha versión para ser liberada(véxase <xref linkend="stabilizing-a-release"/> e <xref linkend="release-lines"/><phrase output="printed"> en <xref linkend="development-cycle"/></phrase>) sen ter que se preocupar acerca de manter controlada unha diana móbil.

source: Use branches liberally, and encourage others to use them. But also make sure that a given branch is only active for exactly as long as needed. Every active branch is a slight drain on the community's attention. Even those who are not working in a branch still maintain a peripheral awareness of what's going on in it. Such awareness is desirable, of course, and commit emails should be sent out for branch commits just as for any other commit. But branches should not become a mechanism for dividing the development community. With rare exceptions, the eventual goal of most branches should be to merge their changes back into the main line and disappear.
gl: Usa as ramas con liberalidade, e aconsella os demais a que tamén o fagan. Mais tamén debes estar seguro de que cada rama vai permanecer activa exactamente o tempo estritamente necesario. Cada rama é unha pequena fuga na atención da comunidade. Mesmo os que non están a traballar na rama manteñen un interese periférico sobre o que está a acontecer nela. Ese interese é desexable, por suposto, e deberíanse enviar correos de incorporación de mudanzas exactamente igual que no caso dos correspondentes ao corpo principal do proxecto. Mais as ramas non deben tornar nun mecanismo de división da comunidade de desenvolvemento. Salvo raras excepcións, o obxectivo final das máis das ramas debería ser o de que as súas mudanzas sexan reintegradas á liña principal e que a rama desapareza.

source: Singularity of information
gl: Singularidade da información

source: Merging has an important corollary: never commit the same change twice. That is, a given change should enter the version control system exactly once. The revision (or set of revisions) in which the change entered is its unique identifier from then on. If it needs to be applied to branches other than the one on which it entered, then it should be merged from its original entry point to those other destinations&mdash;as opposed to committing a textually identical change, which would have the same effect in the code, but would make accurate bookkeeping and release management impossible.
gl: A fusión (merging) ten un corolario importante: nunca envíes unha mesma mudanza dúas veces. Isto é, cada mudanza dada debería ser incorporada ao sistema de control de versións exactamente unha soa vez. A revisión (ou conxunto de revisións) na que a mudanza foi incorporada será o seu identificador único de aí en diante. Se for necesario incorporala a outras ramas distintas daquela na que tivo a súa orixe, entón debería ser fusionada (merged) desde o seu punto de entrada orixinal cara a eses outros destinos&mdash;en oposición á integración dunha mudanza textualmente idéntica, que tería o mesmo efecto sobre o código, mais que tornaría imposibles o arquivamento preciso e a xestión de liberacións.

source: The practical effects of this advice differ from one version control system to another. In some systems, merges are special events, fundamentally distinct from commits, and carry their own metadata with them. In others, the results of merges are committed the same way other changes are committed, so the primary means of distinguishing a "merge commit" from a "new change commit" is in the log message. In a merge's log message, don't repeat the log message of the original change. Instead, just indicate that this is a merge, and give the identifying revision of the original change, with at most a one-sentence summary of its effect. If someone wants to see the full log message, she should consult the original revision.
gl: Os efectos prácticos deste consello van diferir dun sistema de control de versións a outro. Nalgúns sistemas, as fusións son acontecementos especiais, fundamentalmente diferentes da incorporación de mudanzas, e presentan o seu propio conxunto de metadatos. Noutros, o resultado das fusións é incorporado exactamente igual que calquera outra mudanza de xeito que o medio fundamental para distinguir unha "incorporación dun ha fusión" dunha "incorporación dunha mudanza" estará nos contidos da mensaxe de rexistro. Nunha mensaxe de rexistro dunha fusión nunca debes repetir a mensaxe de rexistro da mudanza orixinal. Pola contra, debes indicar tan só que se trata dunha fusión, e asígnalle o identificador de revisión da mudanza orixinal, engadindo como moito un breve resumo dos seus efectos. Se alguén quixer ver a mensaxe de rexistro completa, deberá consultar a revisión orixinal.

source: The reason it's important to avoid repeating the log message is that log messages are sometimes edited after they've been committed. If a change's log message were repeated at each merge destination, then even if someone edited the original message, she'd still leave all the repeats uncorrected&mdash;which would only cause confusion down the road.
gl: A razón pola que a repetición das mensaxes de rexistro é importante é que ás veces son editadas despois de enviada a mudanza. Se a mensaxe de rexistro de cada mudanza fose repetida en cada destino de fusión, entón se alguén editara a mensaxe orixinal, quedarían sen corrixir as distintas repeticións&mdash;o que simplemente causaría confusión no futuro.

source: The same principle applies to reverting a change. If a change is withdrawn from the code, then the log message for the reversion should merely state that some specific revision(s) is being reverted, <emphasis>not</emphasis> describe the actual code change that results from the reversion, since the semantics of the change can be derived by reading the original log message and change. Of course, the reversion's log message should also state the reason why the change is being reverted, but it should not duplicate anything from the original change's log message. If possible, go back and edit the original change's log message to point out that it was reverted.
gl: O mesmo principio pode ser aplicado cando se reverte unha mudanza. No caso de que unha mudanza sexa descartada do código, a única mensaxe de rexistro que debería engadirse debería tan só especificar que unha revisión concreta está a ser descartada, <emphasis>nunca</emphasis> se debería describir a mudanza resultante desa operación, xa que a semántica da mudanza pode derivarse mediante a simple lectura da mensaxe de rexistro da mudanza orixinal. Por suposto, a mensaxe de rexistro do descarte debería igualmente deixar claro por que se decide ese descarte, mais non debería duplicar ningunha información procedente da mensaxe orixinal de rexistro. Sempre que for posible, o que si se debe facer é editar esa mensaxe orixinal para explicar nela que a mudanza á que se refire foi finalmente descartada.

source: All of the above implies that you should use a consistent syntax for referring to revisions. This is helpful not only in log messages, but in emails, the bug tracker, and elsewhere. If you're using CVS, I suggest "<literal>path/to/file/in/project/tree:REV</literal>", where REV is a CVS revision number such as "1.76". If you're using Subversion, the standard syntax for revision 1729 is "r1729" (file paths are not needed because Subversion uses global revision numbers). In other systems, there is usually a standard syntax for expressing the changeset name. Whatever the appropriate syntax is for your system, encourage people to use it when referring to changes. Consistent expression of change names makes project bookkeeping much easier (as we will see in <xref linkend="communications"/> and <xref linkend="development-cycle"/>), and since a lot of the bookkeeping will be done by volunteers, it needs to be as easy as possible.
gl: Todo o que antecede implica que se debería empregar unha sintaxe coherente para referirse ás revisións. Isto non é só importante para as mensaxes de rexistro, senón tamén nas de correo electrónico, o xestor de erros (bugtracker), e en toda a documentación do proxecto. Se estás a usar CVS, suxírote "<literal>path/to/file/in/project/tree:REV</literal>", na que REV é un número de revisión concreto do CVS tal como "1.76". Se estás a empregar Subversion, a sintaxe estándar para as revisións 1729 é "r1729" (as rutas dos arquivos non son precisas xa que Subversion emprega números de revisión globais). Noutros sistemas, normalmente hai tamén unha sintaxe estándar para denominar o conxunto de mudanzas. Calquera que for a sintaxe axeitada para o teu sistema, anima a xente a usárena para referírense ás mudanzas. A expresión coherente dos nomes de mudanzas axuda a facer máis doado o arquivamento do proxecto (como veremos en <xref linkend="communicacións"/> and <xref linkend="ciclo-de-desenvolvemento"/>) e como unha boa parte do traballo de arquivamento vai ser feita por voluntarios, mellor mantelo tan simple como for posible.

source: See also <xref linkend="releases-and-daily-development"/><phrase output="printed"> in <xref linkend="development-cycle"/></phrase>.
gl: Podes ver tamén <xref linkend="liberacións-e-desenvolvemento-diario"/><phrase output="printed"> en <xref linkend="ciclo-de-desenvolvemento"/></phrase>.

source: Authorization
gl: Autorización

source: Most version control systems offer a feature whereby certain people can be allowed or disallowed from committing in specific sub-areas of the repository. Following the principle that when handed a hammer, people start looking around for nails, many projects use this feature with abandon, carefully granting people access to just those areas where they have been approved to commit, and making sure they can't commit anywhere else. (See <xref linkend="committers"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase> for how projects decide who can commit where.)
gl: Os máis dos sistemas de control de versións ofrecen unha característica pola cal determinadas persoas poden ser autorizadas ou non a introduciren mudanzas en subáreas concretas do repositorio do proxecto. Seguindo o principio de que cando agarras un martelo, a xente comeza a ollar ao redor en busca de cravos, moitos proxectos empregan esta característica con abandono, garantindo coidadosamente que a xente teña acceso a xusto aquelas áreas para as que están autorizados a subiren mudanzas, e que non poidan facelo en ningunha outra parte. (Podes consultar <xref linkend="committers"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase> para entenderes como se decide quen vai poder introducir mudanzas en que partes do proxecto)

source: There is probably little harm done by exercising such tight control, but a more relaxed policy is fine too. Some projects simply use an honor system: when a person is granted commit access, even for a sub-area of the repository, what they actually receive is a password that allows them to commit anywhere in the project. They're just asked to keep their commits in their area. Remember that there is no real risk here: in an active project, all commits are reviewed anyway. If someone commits where they're not supposed to, others will notice it and say something. If a change needs to be undone, that's simple enough&mdash;everything's under version control anyway, so just revert.
gl: Probablemente haxa pouco risco de danos por exercer un control tan estrito, mais unha política máis relaxada é tamén viable. Algúns proxectos simplemente usan un sistema honorífico: cando alguén recibe autorización para acceder ao sistema de control de mudanzas, mesmo para unha subárea do repositorio, o que en realidade están a recibir é un pasaporte para poderen introducir mudanzas en calquera parte do proxecto. Simplemente se lles suxire que manteñan as súas mudanzas na súa área. Ten en conta que non existe ningún risco real en facelo así: nun proxecto activo, todos as mudanzas integradas son revisadas por alguén. Se un colaborador introducir mudanzas nunha área na que non está autorizado a traballar, outros vanse decatar e o van comentar. Se for preciso desfacer unha mudanza, chega con iso&mdash;todo está sometido ao sistema de control de versións, así que simplemente terás que reverter a mudanza.

source: There are several advantages to the relaxed approach. First, as developers expand into other areas (which they usually will if they stay with the project), there is no administrative overhead to granting them wider privileges. Once the decision is made, the person can just start committing in the new area right away.
gl: Hai moitas vantaxes nunha aproximación relaxada. Primeiro, segundo os desenvolvedores van expandíndose por outras áreas (o que con seguridade vai ocorrer, se é que se manteñen no proxecto), non hai ningunha dificultade administrativa en ampliarlles os privilexios de acceso. Unha vez que se toma a decisión, a persoa en cuestión pode comezar inmediatamente a traballar na nova área.

source: Second, expansion can be done in a more fine-grained manner. Generally, a committer in area X who wants to expand to area Y will start posting patches against Y and asking for review. If someone who already has commit access to area Y sees such a patch and approves of it, they can just tell the submitter to commit the change directly (mentioning the reviewer/approver's name in the log message, of course). That way, the commit will come from the person who actually wrote the change, which is preferable from both an information management standpoint and from a crediting standpoint.
gl: Segundo, a expansión pode ser feita dun xeito máis granular. Xeralmente, un desenvolvedor da área X que queira expandir o seu interese á área Y, comezará a publicar aportamentos a Y e solicitar que sexan revisadas. Se alguén que xa tiña privilexios de acceso a Y ve unha das mencionados aportamentos e a aproba, simplemente poden indicarlle ao desenvolvedor que incorpore a mudanza directamente ao repositorio (mencionando o nome do revisor na mensaxe de rexistro ,por suposto). Así, a incorporación da mudanza vai ser feita por quen escribiu a mudanza, o que é máis axeitado tanto desde o punto de vista da xestión da información como desde o da acreditación de autorías.

source: Last, and perhaps most important, using the honor system encourages an atmosphere of trust and mutual respect. Giving someone commit access to a subdomain is a statement about their technical preparedness&mdash;it says: "We see you have expertise to make commits in a certain domain, so go for it." But imposing strict authorization controls says: "Not only are we asserting a limit on your expertise, we're also a bit suspicious about your <emphasis>intentions</emphasis>." That's not the sort of statement you want to make if you can avoid it. Bringing someone into the project as a committer is an opportunity to initiate them into a circle of mutual trust. A good way to do that is to give them more power than they're supposed to use, then inform them that it's up to them to stay within the stated limits.
gl: Por último, e pode que sexa o máis importante, empregar un sistema meritocrático crea unha atmosfera de confianza e respecto mutuos. Darlle a alguén acceso a un subdominio é unha manifestación acerca da súa preparación técnica&mdash;é como dicir: "Ei!, xa vemos que tes experiencia como para incorporar mudanzas neste dominio, así que adiante". Pola contra, establecer un sistema moi estrito de control de accesos é como dicir: "Non só estamos poñendo en dúbida a túa experiencia, tamén temos sospeitas sobre as túas <emphasis>intencións</emphasis>." E ese é o tipo de frases que non che gustaría empregar , se é que podes evitalo. Incorporar alguén ao proxecto como desenvolvedor é unha oportunidade para inicialo no círculo de confianza mutua. Unha boa maneira de facelo é concederlle máis poder do que se lle supón que vai usar, e despois informarlles que está nas súas mans manterse dentro dos límites acordados.

source: The Subversion project has operated on the honor system way for more than four years, with 33 full and 43 partial committers as of this writing. The only distinction the system actually enforces is between committers and non-committers; further subdivisions are maintained solely by humans. Yet we've never had a problem with someone deliberately committing outside their domain. Once or twice there's been an innocent misunderstanding about the extent of someone's commit privileges, but it's always been resolved quickly and amiably.
gl: O proxecto Subversion vén traballando co sistema meirotcrático desde hai máis de catro anos, con 33 colaboradores sobre a totalidade do proxecto e 43 sobre partes do mesmo cando foi escrita a presente obra. A única distinción que o sistema mantén realmente por si mesmo é entre quen pode subir mudanzas e quen non; as restantes divisións son mantidas exclusivamente por humanos. A día de hoxe non tivemos ningún problema con alguén que pretendera incorporar mudanzas fóra do seu dominio deliberadamente. Unha vez ou dúas houbo algunha falta de entendemento acerca de ata onde chegan exactamente os privilexios de alguén, mais sempre foron resoltas rápida e amigablemente.

source: Obviously, in situations where self-policing is impractical, you must rely on hard authorization controls. But such situations are rare. Even when there are millions of lines of code and hundreds or thousands of developers, a commit to any given code module should still be reviewed by those who work on that module, and they can recognize if someone committed there who wasn't supposed to. If regular commit review <emphasis>isn't</emphasis> happening, then the project has bigger problems to deal with than the authorization system anyway.
gl: Obviamente, en situacións nas que o autocontrol non é práctico, deberás establecer controis de autenticación severos. Mais estas situacións son pouco frecuentes. Mesmo cando se está a falar de millóns de liñas de código e centos ou milleiros de desenvolvedores, a incorporación dunha mudanza a un módulo de código concreto debería ser revisada por quen traballa nese módulo preciso, e son eles quen poden recoñecer se alguén que non debería está a enviar mudanzas. Se a revisión regular de mudanzas a incorporar <emphasis>non</emphasis> está a funcionar axeitadamente, entón é que o proxecto ten problemas máis importantes que resolver que os relativos ao sistema de autenticacións.

source: In summary, don't spend too much time fiddling with the version control authorization system, unless you have a specific reason to. It usually won't bring much tangible benefit, and there are advantages to relying on human controls instead.
gl: En resumo, non pases moito tempo chafullando no sistema de autenticación do control de versións, non sendo que teñas unha razón específica para facelo. Xeralmente non vai producir ningún beneficio tanxible e, porén, atoparás moitas vantaxes en deixar o control en mans dos humanos.

source: None of this should be taken to mean that the restrictions themselves are unimportant, of course. It would be bad for a project to encourage people to commit in areas where they're not qualified. Furthermore, in many projects, full (unrestricted) commit access has a special status: it implies voting rights on project-wide questions. This political aspect of commit access is discussed more in <xref linkend="electorate"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase>.
gl: Nada do que antecede debe ser tomado no sentido de que as restricións carecen de importancia en si mesmas, por suposto. Pode ser desastroso para un proxecto deixar que a xente incorpore mudanzas en áreas para as que non están cualificados. Aínda máis, en moitos proxectos, o acceso completo (sen restricións) responde a un status especial: implica gozar do dereito a votar en cuestións que afecten a calquera das partes do proxecto. Este aspecto político dos accesos á incorporación de mudanzas é discutido máis a fondo en <xref linkend="electorado"/><phrase output="printed"> e en <xref linkend="infrastrutura-social"/></phrase>.

source: Bug Tracker
gl: Xestor de erros (Bug Tracker)

source: Bug tracking is a broad topic; various aspects of it are discussed throughout this book. Here I'll try to concentrate mainly on setup and technical considerations, but to get to those, we have to start with a policy question: exactly what kind of information should be kept in a bug tracker?
gl: A xestión de erros é unha cuestión moi ampla; varios dos aspectos que lle afectan son discutidos ao longo deste libro. Aquí eu vou tratar de concentrarme principalmente na súa configuración e máis en consideracións técnicas, mais antes de chegar a ese punto, temos que comezar cunha cuestión política: exactamente que información debe ser mantida nun xestor de erros?
